# Pandas

### Series

In [37]:
import pandas as pd

In [38]:
#Diferença entre lista em uma série 
lista = [3, 5, 6, 7,30, 55]
serie = pd.Series(lista)
print(f'lista:\n{lista}')
print()
print(f'serie do pandas:\n{serie}')

lista:
[3, 5, 6, 7, 30, 55]

serie do pandas:
0     3
1     5
2     6
3     7
4    30
5    55
dtype: int64

In [39]:
#Podemos transformar dicionários em séries, assim o índice da série passa a ser a chave(key) do dicionário
notas = {'Gi': 10, 'Tiago':7.0, 'Julia':4}
serie_notas = pd.Series(notas)
print(serie_notas)

Gi       10.0
Tiago     7.0
Julia     4.0
dtype: float64

In [40]:
#Também podemos navegar por essa série. Para visualizar um elemento usamos:
print(serie_notas['Gi'])

10.0

In [41]:
#Algumas funções disponíveis
print(f'Média: {serie_notas.mean()}')
print(f'Mediana: {serie_notas.median()}\n')
print(f'Soma: {serie_notas.sum()}\n')
print(f'Descrição: \n{serie_notas.describe()}')

Média: 7.0
Mediana: 7.0

Soma: 21.0

Descrição:
count     3.0
mean      7.0
std       3.0
min       4.0
25%       5.5
50%       7.0
75%       8.5
max      10.0
dtype: float64

### Dataframes

In [71]:
#Transformando um dicionário em dataframe
dicionario = {
    "Nomes": ["Ana", "Bruno", "Carlos", "Daniela", "Eduardo"],
    "Cidades": ["Salvador", "Rio de Janeiro", "São Paulo", "Curitiba", "Porto Alegre"],
    "CEP": ["40000-000", "20000-000", "01000-000", "80000-000", "90000-000"]
        }
df = pd.DataFrame(dicionario)

In [72]:
df

     Nomes         Cidades        CEP
0      Ana        Salvador  40000-000
1    Bruno  Rio de Janeiro  20000-000
2   Carlos       São Paulo  01000-000
3  Daniela        Curitiba  80000-000
4  Eduardo    Porto Alegre  90000-000

In [73]:
#Para selecionar uma coluna
df['Cidades']

0          Salvador
1    Rio de Janeiro
2         São Paulo
3          Curitiba
4      Porto Alegre
Name: Cidades, dtype: object

In [74]:
#Para selecionar um dado especifico de uma coluna
df['Cidades'][1]

'Rio de Janeiro'

### Adicionando uma coluna

In [75]:
#Adicionando uma nova coluna nessa tabela
df['Celsius'] = [25, 30, 35, 30, 45]

In [65]:
df

     Nomes         Cidades        CEP  Celsius
0      Ana        Salvador  40000-000       25
1    Bruno  Rio de Janeiro  20000-000       30
2   Carlos       São Paulo  01000-000       35
3  Daniela        Curitiba  80000-000       30
4  Eduardo    Porto Alegre  90000-000       45
5  Matheus       Barreiras  50000-000       40

In [76]:
#Também posso realizar operações matemáticas com aqueles realizados em series
df['Celsius'].mean()

33.0

In [77]:
#Filtragem. Posso criar uma váriavel para receber essa filtragem e depois imprimi-la
filtro = df['Celsius'] == 30

In [78]:
#Assim eu consigo imprimir apenas os lugares em que O Celsius são iguais a 30
df[filtro]

     Nomes         Cidades        CEP  Celsius
1    Bruno  Rio de Janeiro  20000-000       30
3  Daniela        Curitiba  80000-000       30

### Adicionando uma linha

In [79]:
#Para adicionar uma nova informação, podemos criar um novo dicionário e usar o append()
df = df.append({'Nomes':'Matheus', 'Cidades': 'Macapá', 'CEP': '50000-000', 'Celsius': 40}, ignore_index = True)

C:\Users\Giovanna\AppData\Local\Temp\ipykernel_9732\3310644161.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append({'Nomes':'Matheus', 'Cidades': 'Macapá', 'CEP': '50000-000', 'Celsius': 40}, ignore_index = True)

In [80]:
df #Nova tabela

     Nomes         Cidades        CEP  Celsius
0      Ana        Salvador  40000-000       25
1    Bruno  Rio de Janeiro  20000-000       30
2   Carlos       São Paulo  01000-000       35
3  Daniela        Curitiba  80000-000       30
4  Eduardo    Porto Alegre  90000-000       45
5  Matheus          Macapá  50000-000       40

### Editar um dado

In [81]:
#1ª seleciona o dado usando uma máscara
mask_edit = df['Nomes'] == 'Matheus'
print(df[mask_edit])

     Nomes Cidades        CEP  Celsius
5  Matheus  Macapá  50000-000       40

In [82]:
#2ª editar o dado usando o loc
df.loc[mask_edit, 'Cidades'] = 'Barreiras'

In [83]:
#Resultado após a edição
df

     Nomes         Cidades        CEP  Celsius
0      Ana        Salvador  40000-000       25
1    Bruno  Rio de Janeiro  20000-000       30
2   Carlos       São Paulo  01000-000       35
3  Daniela        Curitiba  80000-000       30
4  Eduardo    Porto Alegre  90000-000       45
5  Matheus       Barreiras  50000-000       40